In [2]:
import pandas as pd
import numpy as np

In [7]:
d = {'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
   ....:      'two': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}

In [22]:
s1 =  pd.Series([1., 2., 3 , 4.], index=[1, 'b', 'c','solo s1'])

In [23]:
s2 =  pd.Series([1., 2., 3. , 5.], index=['a', 'b', 'c','solo s_2'])

In [24]:
print(s1)
print(s2)
print(s1 + s2)
# per le etichette non in comune viene messo NaN

1          1.0
b          2.0
c          3.0
solo s1    4.0
dtype: float64
a           1.0
b           2.0
c           3.0
solo s_2    5.0
dtype: float64
1           NaN
a           NaN
b           4.0
c           6.0
solo s1     NaN
solo s_2    NaN
dtype: float64

In [25]:
df = pd.DataFrame(d)

In [26]:
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [31]:
df[['one']] # select by column

   one
a  1.0
b  2.0
c  3.0
d  NaN

In [34]:
df[['two']]

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [12]:
df.loc['b'] # select by row label

one    2.0
two    2.0
Name: b, dtype: float64

In [19]:
df.iloc[2] # select by row index

one    3.0
two    3.0
Name: c, dtype: float64

In [40]:
df.loc[(df['one']>1) & (df['one']>1)] # select row conditional SELECT * FROM DF WHERE ONE > 1

   one  two
b  2.0  2.0
c  3.0  3.0

In [16]:
df[df['one']>1] # same as before but shorter

   one  two
b  2.0  2.0
c  3.0  3.0

In [36]:
df[df['one']>1][['two']] # SELECT TWO FROM DF WHERE ONE > 1

   two
b  2.0
c  3.0

In [17]:
#Transpose
df[:].T

       a    b    c    d
one  1.0  2.0  3.0  NaN
two  1.0  2.0  3.0  4.0